[
  [
    "Я делаю это с утра",
    "I have been doing it since morning"
  ],
  [
    "Он курит слишком много в последнее время",
    "He has been smoking too much lately"
  ],
  [
    "Я смотрю это видео в течение пятнадцати минут",
    "I’ve been watching this video for fifteen minutes"
  ],
  [
    "Он изучает испанский в течение полугода",
    "He’s been learning Spanish for half a year"
  ],
  [
    "Я работаю здесь почти один год",
    "I’ve been working here for almost one year"
  ],
  [
    "Мы читаем с утра",
    "We’ve been reading since morning"
  ],
  [
    "Как долго вы живете вместе?",
    "How long have you been living together?"
  ],
  [
    "Как долго она работает здесь?",
    "How long has she been working here?"
  ],
  [
    "Он здесь с утра",
    "He's been here since morning"
  ],
  [
    "Я готовлюсь к этому экзамену два дня",
    "I have been preparing for this exam for two days"
  ],
  [
    "Он живет в деревне уже более десяти лет",
    "He has been living in the village for more than ten years"
  ],
  [
    "Я тренируюсь с самого утра",
    "I have been training since morning"
  ],
  [
    "Она учится в университете полтора года",
    "She has been studying at university for a year and a half"
  ],
  [
    "Она здесь весь день",
    "She's been here all day"
  ],
  [
    "Как давно ты там учишься?",
    "How long have you been studying there?"
  ],
  [
    "Я делаю это упражнение более десяти минут",
    "I have been doing this exercise for more than ten minutes"
  ],
  [
    "Я изучаю английский два года",
    "I have been learning English for two years"
  ],
  [
    "Я думаю об этом весь день",
    "I have been thinking about it all day"
  ],
  [
    "Она ждет нас пять минут",
    "She has been waiting for us for five minutes"
  ],
  [
    "Как давно ты изучаешь английский язык?",
    "How long have you been learning English?"
  ],
  [
    "В последнее время я очень интенсивно тренируюсь",
    "I have been training very intensively lately"
  ],
  [
    "Как давно вы встречаетесь?",
    "How long have you been dating?"
  ],
  [
    "Он преподает английский около десяти лет",
    "He's been teaching English for about ten years"
  ],
  [
    "Я занимаюсь этим весь день",
    "I have been doing it all day"
  ],
  [
    "Мы разговариваем по телефону целый час",
    "We've been talking on the phone for an hour"
  ],
  [
    "Как давно ты здесь учишься?",
    "How long have you been studying here?"
  ],
  [
    "Как давно ты здесь работаешь?",
    "How long have you been working here?"
  ],
  [
    "Я думаю об этом весь день",
    "I've been thinking about it all day"
  ],
  [
    "Она готовит весь день",
    "She's been cooking all day"
  ],
  [
    "Я очень занят в последнее время",
    "I have been very busy lately"
  ],
  [
    "Я жду этого звонка весь день",
    "I've been waiting for this call all day"
  ],
  [
    "Он учит английский полгода",
    "He has been learning English for half a year"
  ],
  [
    "Он слишком много курит в последнее время",
    "He has been smoking too much lately"
  ],
  [
    "Он путешествует по Европе два месяца",
    "He has been travelling in Europe for two months"
  ],
  [
    "Как долго ты здесь живешь?",
    "How long have you been living here?"
  ],
  [
    "Она готовит больше часа",
    "She has been cooking for more than an hour"
  ],
  [
    "Я жду тебя около пятнадцати минут",
    "I've been waiting for you for about fifteen minutes"
  ],
  [
    "Я смотрю это видео двадцать минут",
    "I've been watching this video for twenty minutes"
  ],
  [
    "Мой друг ищет работу с августа",
    "My friend has been looking for a job since August"
  ],
  [
    "Я работаю здесь с прошлой недели",
    "I have been working here since last week"
  ],
  [
    "Ты играл весь день",
    "You have been playing all day"
  ],
  [
    "Они встречаются около двух месяцев",
    "They've been dating for about two months"
  ],
  [
    "Я не видел его в последнее время",
    "I haven't seen him lately"
  ],
  [
    "Они путешествуют по Азии три недели",
    "They have been travelling in Asia for three weeks"
  ],
  [
    "Как долго ты здесь находишься?",
    "How long have you been staying here?"
  ],
  [
    "Я очень давно изучаю английский",
    "I've been learning English for a very long time"
  ],
  [
    "Я работаю с утра",
    "I have been working since morning"
  ],
  [
    "Как долго вы живете вместе?",
    "How long have you been living together?"
  ],
  [
    "Что ты делаешь последние двадцать минут?",
    "What have you been doing for the last twenty minutes?"
  ],
  [
    "Как долго ты ищешь работу?",
    "How long have you been looking for a job?"
  ],
  [
    "Я думаю об этой вещи с тех пор, как ты это сказал",
    "I have been thinking about this thing since you said it"
  ],
  [
    "Я пытаюсь связаться с ней весь день",
    "I have been trying to get in touch with her all day"
  ],
  [
    "Как давно вы помолвлены?",
    "How long have you been engaged?"
  ],
  [
    "В последнее время она очень интересуется религией",
    "She has been very interested in religion lately"
  ],
  [
    "Снег идет весь день",
    "It's been snowing all day"
  ],
  [
    "Я не видел его с тех пор, как мы закончили школу",
    "I haven't seen him since we finished school"
  ],
  [
    "Я знаю его очень долгое время",
    "I have known him for a very long time"
  ],
  [
    "Как давно вы женаты?",
    "How long have you been married?"
  ],
  [
    "Она покупает еду на рынке в последнее время",
    "She has been buying food in the market lately"
  ],
  [
    "Она заказывает еду онлайн в последнее время",
    "She has been ordering food online lately"
  ],
  [
    "Она покупает одежду онлайн в последнее время",
    "She has been buying clothes online lately"
  ],
  [
    "Я очень заинтересован в этом в последнее время",
    "I have been very interested in it lately"
  ],
  [
    "Я очень заинтересован в политике в последнее время",
    "I have been very interested in politics lately"
  ],
  [
    "Она очень интересуется музыкой в последнее время",
    "She has been very interested in music lately"
  ],
  [
    "Как давно ты живешь в этом отеле?",
    "How long have you been staying in this hotel?"
  ],
  [
    "Как давно ты остаешься там?",
    "How long have you been staying there?"
  ],
  [
    "Я живу в этом отеле два дня",
    "I have been staying in this hotel for two days"
  ],
  [
    "Чем ты занимаешься последние два года?",
    "What have you been doing for the last two years?"
  ],
  [
    "Что ты изучаешь последние два года?",
    "What have you been studying for the last two years?"
  ],
  [
    "Куда ты ездишь последние два года?",
    "Where have you been going for the last two years?"
  ],
  [
    "Я пытаюсь связаться с ним весь день",
    "I have been trying to contact him all day"
  ],
  [
    "Я пытаюсь дозвониться до него весь день",
    "I have been trying to call him all day"
  ],
  [
    "Я пытаюсь найти это весь день",
    "I have been trying to find it all day"
  ],
  [
    "Я чаще езжу на велосипеде в последнее время",
    "I have been going cycling more often lately"
  ],
  [
    "Я чаще плаваю в последнее время",
    "I have been swimming more often lately"
  ],
  [
    "Я чаще хожу туда в последнее время",
    "I have been going there more often lately"
  ],
  [
    "Она работает менеджером пять лет",
    "He has been working as a manager for five years"
  ],
  [
    "Он работает инженером пять лет",
    "He has been working as an engineer for five years"
  ],
  [
    "Я работаю там пять лет",
    "I have been working there for five years"
  ],
  [
    "Сильный снег идет весь день",
    "It's been snowing heavily all day"
  ],
  [
    "Сейчас идет снег",
    "It is snowing now"
  ],
  [
    "Сильный дождь идет весь день",
    "It's been raining heavily all day"
  ],
  [
    "Как долго они помолвлены?",
    "How long have they been engaged?"
  ],
  [
    "Они помолвлены один год",
    "They have been engaged for one year"
  ],
  [
    "Идет дождь так сильно весь день",
    "It has been raining so heavily all day"
  ],
  [
    "Сильный дождь идет в данный момент",
    "It is raining so heavily at the moment"
  ],
  [
    "У меня было мало свободного времени в последнее время",
    "I have had little free time lately"
  ],
  [
    "Я получаю много телефонных звонков в последнее время",
    "I have been getting lots of phone calls lately"
  ],
  [
    "Мальчик учится полчаса",
    "The boy has been studying for half an hour"
  ],
  [
    "Я покупаю это на рынке в последнее время",
    "I have been buying it in the market lately"
  ],
  [
    "Как долго ты знаешь ее?",
    "How long have you known her?"
  ],
  [
    "Я не ходил в библиотеку в последнее время",
    "I haven't been going to the library lately"
  ],
  [
    "Мальчики играют в футбол с пяти часов",
    "The boys have been playing football since five o'clock"
  ],
  [
    "Я давно ее знаю",
    "I have known her for a long time"
  ],
  [
    "Как долго ты меня ждал?",
    "How long have you been waiting for me?"
  ],
  [
    "Мой друг учит английский с детства",
    "My friend has been learning English since childhood"
  ],
  [
    "Я нахожусь дома весь день",
    "I have been staying at home all day"
  ],
  [
    "Как давно ты здесь?",
    "How long have you been here?"
  ],
  [
    "Дождь идет весь день",
    "It's been raining all day"
  ],
  [
    "Я очень занят в последнее время",
    "I've been very busy lately"
  ]
]