[
  [
    "Мы будем ждать их ответа",
    "We will be waiting for their answer"
  ],
  [
    "Он будет отдыхать завтра в 9",
    "He will be having a rest tomorrow at 9"
  ],
  [
    "Я буду ждать больше практики",
    "I'll be waiting for more practice"
  ],
  [
    "Я буду записывать новый урок",
    "I'll be recording a new lesson"
  ],
  [
    "Я буду гулять в парке весь день",
    "I will be walking in the park all day"
  ],
  [
    "Я буду смотреть этот урок с 3 до 4",
    "I will be watching this lesson from 3 till 4"
  ],
  [
    "Я не буду отдыхать",
    "I won't be having a rest"
  ],
  [
    "Он не будет спать завтра в 8",
    "He won’t be sleeping tomorrow at 8"
  ],
  [
    "Она будет читать завтра весь день?",
    "Will she be reading all day tomorrow?"
  ],
  [
    "Они будут играть в футбол завтра в 5?",
    "Will they be playing football tomorrow at 5?"
  ],
  [
    "В это время завтра я буду купаться в море",
    "This time tomorrow I will be swimming in the sea"
  ],
  [
    "Я буду отдыхать завтра в 10",
    "I will be having a rest tomorrow at 10"
  ],
  [
    "Я буду ждать следующих видео с нетерпением",
    "I will be waiting for the next videos with impatience"
  ],
  [
    "Я буду ждать нашей встречи с нетерпением",
    "I will be waiting for our meeting with impatience"
  ],
  [
    "Пока мы работаем, они будут отдыхать",
    "While we are working, they will be having a rest"
  ],
  [
    "Я буду ждать твоего сообщения",
    "I will be waiting for your message"
  ],
  [
    "В это время на следующей неделе я буду кататься на лыжах",
    "This time next week I will be skiing"
  ],
  [
    "Мы будем ждать их ответа",
    "We will be waiting for their response"
  ],
  [
    "Я буду спать в полночь",
    "I will be sleeping at midnight"
  ],
  [
    "Она будет смотреть вебинар завтра в это время",
    "She will be watching a webinar this time tomorrow"
  ],
  [
    "Что ты будешь делать завтра в 11?",
    "What will you be doing tomorrow at 11?"
  ],
  [
    "Я буду отдыхать весь день завтра",
    "I will be having a rest all day tomorrow"
  ],
  [
    "Мы будем ждать твой отзыв",
    "We will be waiting for your feedback"
  ],
  [
    "Я буду работать с двух до пяти",
    "I will be working from two to five"
  ],
  [
    "Я буду ждать самых последних новостей",
    "I will be waiting for the latest news"
  ],
  [
    "Я буду купаться в бассейне с трех до пяти",
    "I will be swimming in the swimming pool from 3 to five"
  ],
  [
    "Когда ты придешь завтра, мы будем играть в теннис",
    "When you come tomorrow, we will be playing tennis"
  ],
  [
    "Я буду учить английский язык завтра весь день",
    "I will be learning English tomorrow all day"
  ],
  [
    "Она будет смотреть новости в 9",
    "She will be watching the news at 9"
  ],
  [
    "Я буду ждать твоего ответа",
    "I will be waiting for your response"
  ],
  [
    "Он будет ждать ее приглашения",
    "He will be waiting for her invitation"
  ],
  [
    "Что ты будешь делать завтра в 9 вечера?",
    "What will you be doing at 9pm tomorrow?"
  ],
  [
    "Он будет смотреть этот вебинар завтра в 5",
    "He will be watching this webinar tomorrow at 5"
  ],
  [
    "Я буду ждать твоего подтверждения",
    "I will be waiting for your confirmation"
  ],
  [
    "Пока они отдыхают, мы будем работать",
    "While they are having a rest, we will be working"
  ],
  [
    "Он не будет работать весь день завтра",
    "He won't be working all day tomorrow"
  ],
  [
    "Я буду ждать твоего отзыва",
    "I will be waiting for your feedback"
  ],
  [
    "Я буду ждать твоего звонка",
    "I will be waiting for your call"
  ],
  [
    "Мы будем упаковывать нашу одежду завтра",
    "We'll be packing our clothes this time tomorrow"
  ],
  [
    "Она будет делать покупки весь день",
    "She'll be shopping all afternoon"
  ],
  [
    "Я буду работать весь день завтра",
    "I will be working all day tomorrow"
  ],
  [
    "Мы будем ждать твоего подтверждения",
    "We will be waiting for your confirmation"
  ],
  [
    "Я буду тренироваться в спортзале завтра в это время",
    "I will be training in the gym - this time tomorrow"
  ],
  [
    "В это время завтра я буду работать из дома",
    "This time tomorrow I will be working from home"
  ],
  [
    "Я буду учиться завтра в это время",
    "I'll be studying this time tomorrow"
  ],
  [
    "Они будут играть в футбол в 10 часов утра завтра",
    "They will be playing football at 10 a.m. tomorrow"
  ],
  [
    "Я буду ждать твоего ответа",
    "I will be waiting for your answer"
  ],
  [
    "Я увеличу громкость, если ты не против",
    "I will turn up the volume if you don't mind"
  ],
  [
    "Когда она вернется домой, он будет готовить",
    "When she comes back home, he will be cooking"
  ],
  [
    "Мне придется остановиться на этой заправке сейчас",
    "I will have to stop at this petrol station now"
  ],
  [
    "Я буду учить английский очень интенсивно в этом году",
    "I will be learning English very intensively this year"
  ],
  [
    "Снег будет идти завтра весь день",
    "It will be snowing all day tomorrow"
  ],
  [
    "Когда я вернусь домой, они будут ужинать",
    "When I return home, they will be having dinner"
  ],
  [
    "Я думаю, это произойдет рано или поздно",
    "I think it will happen sooner or later"
  ],
  [
    "Дождь будет идти завтра весь день?",
    "Will it be raining all day tomorrow?"
  ],
  [
    "Снег будет идти завтра весь день?",
    "Will it be snowing all day tomorrow?"
  ],
  [
    "Я нажму на ссылку, которая находится слева",
    "I will click on the link which is on the left"
  ],
  [
    "Ты увидишь это внизу страницы",
    "You will see it at the bottom of the page"
  ],
  [
    "Пока я плаваю, она будет лежать на пляже",
    "While I am swimming, she will be lying on the beach"
  ],
  [
    "Пока я лежу на пляже, она будет плавать",
    "While I am lying on the beach, she will be swimming"
  ],
  [
    "Ты увидишь это вверху страницы",
    "You will see it at the top of the page"
  ],
  [
    "Ты увидишь это вверху этой страницы",
    "You will see it at the top of this page"
  ],
  [
    "Я подумаю об этом еще раз",
    "I will think about it one more time"
  ],
  [
    "Я сделаю это еще раз",
    "I will do it one more time"
  ],
  [
    "Я спрошу тебя еще раз",
    "I will ask you one more time"
  ],
  [
    "Что ты делаешь в данный момент?",
    "What are you doing at the moment?"
  ],
  [
    "Я буду думать о твоем предложении",
    "I will be thinking about your offer"
  ],
  [
    "Я буду думать об этой проблеме",
    "I will be thinking about this problem"
  ],
  [
    "Я буду думать о твоей ситуации",
    "I will be thinking about your situation"
  ],
  [
    "Дождь будет идти завтра весь день",
    "It will be raining all day tomorrow"
  ],
  [
    "Сейчас идет дождь",
    "It is raining now"
  ],
  [
    "Когда она вернется, я буду смотреть фильм",
    "When she returns, I will be watching a movie"
  ],
  [
    "Когда она придет, я буду смотреть этот фильм",
    "When she comes, I will be watching this movie"
  ],
  [
    "Когда она вернется, я буду читать книгу",
    "When she returns, I will be reading a book"
  ],
  [
    "Я уменьшу громкость, если ты не возражаешь",
    "I will turn down the volume if you don't mind"
  ],
  [
    "Я уменьшу громкость, если он не возражает",
    "I will turn down the volume if he doesn't mind"
  ],
  [
    "Я скоро посещу столицу этой страны",
    "I will visit the capital of this country soon"
  ],
  [
    "Я расскажу тебе эту вещь вкратце",
    "I will tell you this thing briefly"
  ],
  [
    "Я нажму на ссылку, которая находится справа",
    "I will click on the link which is on the right"
  ],
  [
    "Я остановлюсь на следующей заправке",
    "I will stop at the next petrol station"
  ],
  [
    "Я посещу столицу Англии в следующем месяце",
    "I will visit the capital of England next month"
  ],
  [
    "Я думаю, я подам заявление на новую работу на этой неделе",
    "I think I will apply for a new job this week"
  ],
  [
    "Я постараюсь водить более осторожно",
    "I will try to drive more carefully"
  ],
  [
    "Я буду отсутствовать на следующей неделе",
    "I will be away next week"
  ],
  [
    "Я нажму на ссылку",
    "I will click on the link"
  ],
  [
    "Он поедет кататься на лыжах завтра",
    "He will go skiing tomorrow"
  ],
  [
    "Я скажу это вкратце",
    "I will say it briefly"
  ],
  [
    "Никто не поймет это",
    "No one will understand it"
  ]
]