[
  [
    "Когда мой босс придет на работу, я скажу тебе",
    "When my boss comes to work, I will tell you"
  ],
  [
    "Я приду к тебе, если ты позвонишь мне",
    "I will come to you if you call me"
  ],
  [
    "Когда он закончит свою работу, он отдохнет",
    "When he finishes his work, he will rest"
  ],
  [
    "Он сможет сдать тест, если будет учиться усерднее",
    "He will be able to pass the test if he studies harder"
  ],
  [
    "Когда твой друг узнает это, он будет очень удивлен",
    "When your friend knows it, he will be very surprised"
  ],
  [
    "Я дам тебе знать, когда мой коллега придет на работу",
    "I will let you know when my colleague comes to work"
  ],
  [
    "Когда мой босс придет на работу, я дам тебе знать",
    "When my boss comes to work, I will let you know"
  ],
  [
    "Все будут шокированы, в случае, если это произойдет",
    "Everyone will be shocked in case it happens"
  ],
  [
    "Я смогу сделать это после того, как я сдам этот экзамен",
    "I will be able to do it after I pass this exam"
  ],
  [
    "Если он совершит ошибку, никто этого не заметит",
    "If he makes a mistake, nobody will notice it"
  ],
  [
    "Если будет хорошая погода, мы поедем на дачу",
    "If the weather is fine, we will go to the country"
  ],
  [
    "Когда она это узнает, она будет шокирована",
    "When she knows it, she will be shocked"
  ],
  [
    "Если у меня будет достаточно денег, я куплю эти билеты",
    "If I have enough money, I will buy these tickets"
  ],
  [
    "Выключи свет перед тем, как ты пойдешь спать!",
    "Turn off the light before you go to bed!"
  ],
  [
    "Тебе нужно сказать ей об этом прежде, чем она уйдет",
    "You need to tell her about it before she leaves"
  ],
  [
    "Мы обсудим это после того, как она позвонит мне",
    "We will discuss it after she calls me"
  ],
  [
    "Она станет очень нервной, когда узнает об этом",
    "She will become very nervous when she knows it"
  ],
  [
    "Выключи компьютер перед тем, как пойдешь спать!",
    "Switch off the computer before you go to bed!"
  ],
  [
    "Я дам тебе знать, когда она расскажет мне об этом",
    "I will let you know when she tells me about it"
  ],
  [
    "Если завтра он не будет занят, он пойдет на вечеринку",
    "If he isn't busy tomorrow, he will go to the party"
  ],
  [
    "Я сделаю это, если ты не возражаешь",
    "I will do it if you don't mind"
  ],
  [
    "Когда она позвонит мне, я расскажу ей об этом",
    "When she calls me, I will tell her about it"
  ],
  [
    "Если ты будешь слишком много работать, ты скоро устанешь",
    "If you work too much, you will get tired soon"
  ],
  [
    "Если она придет на вечеринку, мы будем счастливы",
    "If she comes to the party, we will be happy"
  ],
  [
    "Если завтра будет солнечно, мы пойдем на пикник",
    "If it is sunny tomorrow, we will go on a picnic"
  ],
  [
    "Если ты возьмешь его с собой, он будет очень доволен",
    "If you take him with you, he will be very pleased"
  ],
  [
    "Если я заработаю эти деньги, я куплю новый компьютер",
    "If I earn this money, I will buy a new computer"
  ],
  [
    "Если я увижу это, я скажу тебе",
    "If I see it, I will tell you"
  ],
  [
    "Я позвоню тебе, как только узнаю это",
    "I will call you as soon as I know it"
  ],
  [
    "Если погода будет хорошая, мы будем играть в теннис",
    "If the weather is good, we will play tennis"
  ],
  [
    "Я приготовлю ужин, как только приеду",
    "I will cook dinner as soon as I arrive"
  ],
  [
    "Она скажет нам, если увидит это",
    "She will tell us if she sees it"
  ],
  [
    "Я останусь здесь, пока ты не вернешься",
    "I will stay here until you come back"
  ],
  [
    "Он забудет об этом, если мы ему не напомним",
    "He will forget it if we don't remind him"
  ],
  [
    "Мы будем играть в теннис, если прекратится дождь",
    "We will play tennis if the rain stops"
  ],
  [
    "Ничто не поможет тебе, если ты не перестанешь это делать",
    "Nothing will help you if you don't stop doing it"
  ],
  [
    "Я расскажу тебе эту информацию, как только узнаю ее",
    "I will tell you this information as soon as I know it"
  ],
  [
    "Она станет очень нервной, когда она выяснит это",
    "She will become very nervous when she finds it out"
  ],
  [
    "Она даст нам знать, когда узнает это",
    "She will let us know when she knows it"
  ],
  [
    "Нам нужно подготовить все до ее прибытия",
    "We need to prepare everything before she arrives"
  ],
  [
    "Ничто не поможет ему, если он не перестанет это делать",
    "Nothing will help him if he doesn't stop doing it"
  ],
  [
    "Что ты будешь делать, если пойдет дождь?",
    "What will you do if it rains?"
  ],
  [
    "Если мы не поторопимся, мы опоздаем на автобус",
    "If we don't hurry up, we will miss the bus"
  ],
  [
    "Я не пойду на вечеринку, если она меня не пригласит",
    "I won't go to the party unless she invites me"
  ],
  [
    "Я пойду на вечеринку, если она пригласит меня",
    "I will go to the party if she invites me"
  ],
  [
    "Я не пойду туда с ней, если она меня не попросит",
    "I won't go there with her unless she asks me"
  ],
  [
    "Я помогу тебе, как только доберусь домой",
    "I will help you as soon as I get home"
  ],
  [
    "Я найду тебя, как только доберусь туда",
    "I will find you as soon as I get there"
  ],
  [
    "Я помогу ему, как только он доберется домой",
    "I will help him as soon as he gets home"
  ],
  [
    "Если я не потороплюсь, я опоздаю",
    "If I don't hurry up, I will be late"
  ],
  [
    "Я опоздаю, если не потороплюсь",
    "I will be late If I don't hurry up"
  ],
  [
    "Если ты не поторопишься, ты опоздаешь",
    "If you don't hurry up, you will be late"
  ],
  [
    "Он опоздает на автобус, если он не уйдет скоро",
    "He will miss the bus if he doesn't leave soon"
  ],
  [
    "Он опоздает, если он не уйдет скоро",
    "He will be late if he doesn't leave soon"
  ],
  [
    "Он опоздает на автобус, если он не поторопится",
    "He will miss the bus if he doesn't hurry up"
  ],
  [
    "Если мальчик будет усердно учиться, он сдаст экзамен",
    "If the boy studies hard, he will pass the exam"
  ],
  [
    "Я буду на работе, пока она мне не позвонит",
    "I will be at work till she calls me"
  ],
  [
    "Я буду там, пока ты не позвонишь мне",
    "I will be there till you call me"
  ],
  [
    "Я буду дома, пока она мне не позвонит",
    "I will be at home till she calls me"
  ],
  [
    "Что ты будешь делать, если он не согласится?",
    "What will you do if he doesn't agree?"
  ],
  [
    "Что ты скажешь, если он не согласится?",
    "What will you say if he doesn't agree?"
  ],
  [
    "Что ты скажешь, если она не согласится сделать это?",
    "What will you say if she doesn't agree to do it?"
  ],
  [
    "Что мы будем делать, если он откажется?",
    "What will we do in case he refuses?"
  ],
  [
    "Что мы будем делать, если он откажется?",
    "What will we do if he refuses?"
  ],
  [
    "Что мы будем делать, если он не согласится?",
    "What will we do if he doesn't agree?"
  ],
  [
    "Когда я узнаю это, я дам тебе знать",
    "When I know it, I will let you know"
  ],
  [
    "Когда я найду это, я дам тебе знать",
    "When I find it, I will let you know"
  ],
  [
    "Когда я сделаю это, я дам ему знать",
    "When I do it, I will let him know"
  ],
  [
    "Если этого не произойдет, это будет очень странно",
    "If it doesn't happen it will be very strange"
  ],
  [
    "Он свяжется с тобой, когда выяснит это",
    "He will contact you when he finds it out"
  ],
  [
    "Когда он это узнает, он даст мне знать",
    "When he knows it, he will let me know"
  ],
  [
    "Я дам тебе знать, когда выясню это",
    "I will let you know when I find it out"
  ],
  [
    "Если пойдет дождь, мы не пойдем в парк",
    "If it rains , we won't go to the park"
  ],
  [
    "Я буду дома, пока ты мне не позвонишь",
    "I will be at home until you call me"
  ],
  [
    "Если девушка будет учиться усерднее, она сдаст тест",
    "If the girl studies harder, she will pass the test"
  ],
  [
    "Я свяжусь с тобой, как только выясню это",
    "I will get in touch with you as soon as I find it out"
  ],
  [
    "Он промокнет, если сейчас пойдет дождь",
    "He will get soaked, if it rains now"
  ],
  [
    "Будет очень странно, если она не позвонит мне",
    "It will be very strange if she doesn't call me"
  ],
  [
    "Если сейчас пойдет дождь, мы промокнем",
    "If it rains now, we will get soaked"
  ],
  [
    "Если пойдет дождь, я останусь дома",
    "If it rains, I will stay at home"
  ]
]