[
  [
    "Это типично для американской культуры",
    "It's typical of American culture"
  ],
  [
    "Я никогда не слышал это выражение",
    "I have never heard this expression"
  ],
  [
    "Эти дома сделаны из натуральных материалов",
    "These houses are made from natural materials"
  ],
  [
    "Почему он начал изучать английский?",
    "Why did he start learning English?"
  ],
  [
    "Что ты делаешь в данный момент?",
    "What are you doing at the moment?"
  ],
  [
    "Когда ты начал здесь работать?",
    "When did you start working here?"
  ],
  [
    "Он не боится потерять эту работу",
    "He isn't afraid of losing this job"
  ],
  [
    "Он пришел ко мне, когда я читал статью об этом",
    "He came to me while I was reading an article about it"
  ],
  [
    "Он остановился и поприветствовал нас",
    "He stopped and greeted us"
  ],
  [
    "Я надеюсь, что это однажды произойдет",
    "I hope it will happen one day"
  ],
  [
    "Он не завтракал сегодня",
    "He hasn't had breakfast today"
  ],
  [
    "Я позвонил ему, как только я вернулся домой",
    "I called him as soon as I got home"
  ],
  [
    "Я думаю, что погода скоро улучшится",
    "I think the weather will improve soon"
  ],
  [
    "Сколько лет вы здесь работаете?",
    "How many years have you been working here?"
  ],
  [
    "Я не устал от этого",
    "I didn't get tired of it"
  ],
  [
    "Мне не очень нравится это",
    "I don't really like it"
  ],
  [
    "Я это осознаю сейчас",
    "I realise it now"
  ],
  [
    "Если погода будет хорошая, мы выйдем на улицу",
    "If the weather is fine, we will go out"
  ],
  [
    "Мне потребовалось тридцать минут, чтобы добраться до работы",
    "It took me thirty minutes to get to work"
  ],
  [
    "Я не знал, что делать в этой ситуации",
    "I didn't know what to do in this situation"
  ],
  [
    "Она попросила меня открыть окно",
    "She asked me to open the window"
  ],
  [
    "Где будет проходить конференция?",
    "Where will the conference take place?"
  ],
  [
    "Когда он проснулся, было шесть часов утра",
    "When he woke up, it was six o'clock in the morning"
  ],
  [
    "Ты когда-нибудь слышал эту фразу?",
    "Have you ever heard this phrase?"
  ],
  [
    "Кому ты звонишь?",
    "Whom are you calling?"
  ],
  [
    "Я заберу тебя после работы",
    "I will pick you up after work"
  ],
  [
    "Мой друг прожил здесь всю свою жизнь",
    "My friend has lived here all his life"
  ],
  [
    "Кого ты там встретил?",
    "Whom did you meet there?"
  ],
  [
    "Я не знал куда идти",
    "I didn't know where to go"
  ],
  [
    "Все покрыто снегом",
    "Everything is covered with snow"
  ],
  [
    "Сколько дней ты читаешь эту книгу?",
    "How many days have you been reading this book?"
  ],
  [
    "Мой друг ждал меня, когда я прибыл",
    "My friend was waiting for me when I arrived"
  ],
  [
    "Он не очень любит музыку",
    "He doesn't really like music"
  ],
  [
    "Дороги были покрыты снегом",
    "The roads were covered with snow"
  ],
  [
    "Дом был построен им",
    "The house was built by him"
  ],
  [
    "Сколько страниц было переведено?",
    "How many pages were translated?"
  ],
  [
    "Сколько времени у тебя занимает, чтобы добраться до работы?",
    "How long does it take you to get to work?"
  ],
  [
    "Мы не устали находиться вместе",
    "We didn't get tired of staying together"
  ],
  [
    "Я ищу это весь вечер",
    "I have been looking for it the whole evening"
  ],
  [
    "Мой друг ждет его целый день",
    "My friend has been waiting for him the whole day"
  ],
  [
    "Когда твои занятия закончатся, я тебя заберу",
    "When your classes are over, I'll pick you up"
  ],
  [
    "Он интересуется японской культурой",
    "He is interested in Japanese culture"
  ],
  [
    "Он был очень разочарован ее решением",
    "He felt really disappointed with her decision"
  ],
  [
    "В спальне есть кровать и три стула",
    "There is a bed and three chairs in the bedroom"
  ],
  [
    "На кухне есть несколько стульев и стол",
    "There are some chairs and a table in the kitchen"
  ],
  [
    "В гостиной есть диван и три подушки",
    "There is a sofa and three pillows in the living room"
  ],
  [
    "Как давно ты живешь у него?",
    "How long have you been staying in his place?"
  ],
  [
    "Как долго ты там живёшь?",
    "How long have you been staying there?"
  ],
  [
    "Я живу у нее две недели",
    "I have been staying in her place for two weeks"
  ],
  [
    "Я начал работать над этим проектом два месяца назад",
    "I started working on this project two months ago"
  ],
  [
    "Я начал искать новую работу два месяца назад",
    "I started looking for a new job two months ago"
  ],
  [
    "Я начал работать в этой компании два года назад",
    "I started working in this company two years ago"
  ],
  [
    "Это самое красивое место, которое я когда-либо посещал",
    "It's the most beautiful place I have ever visited"
  ],
  [
    "Это самый красивый город, который я когда-либо видел",
    "It's the most beautiful city I have ever seen"
  ],
  [
    "Я никогда не был в таком красивом месте",
    "I have never been to such a beautiful place"
  ],
  [
    "Он сказал, что весь день шел дождь",
    "He said that it had been raining all day"
  ],
  [
    "Он сказал мне, что весь день шел снег",
    "He told me that it had been snowing all day"
  ],
  [
    "Он сказал, что солнце светило весь день",
    "He said that the sun had been shining all day"
  ],
  [
    "Я закончу этот курс к следующему месяцу",
    "I will have completed this course by next month"
  ],
  [
    "Я сдам этот тест к завтрашнему дню",
    "I will have passed this test by tomorrow"
  ],
  [
    "Я найду новую работу к следующему месяцу",
    "I will have found a new job by next month"
  ],
  [
    "Если дождь не прекратится, мы останемся дома",
    "If it doesn't stop raining, we will stay at home"
  ],
  [
    "Если дождь прекратится, мы выйдем на улицу",
    "If it stops raining, we will go outside"
  ],
  [
    "Это самая интересная книга, которую я когда-либо читал",
    "It's the most interesting book I've ever read"
  ],
  [
    "Мне потребовалось много времени, чтобы понять это",
    "It took me lots of time to understand it"
  ],
  [
    "Как долго она работает учителем?",
    "How long has she been working as a teacher?"
  ],
  [
    "Этот город стал более многолюдным, чем был",
    "This city became more crowded than it had been"
  ],
  [
    "Я ищу свои ключи с утра",
    "I have been looking for my keys since morning"
  ],
  [
    "Он сказал, что так долго ждал тебя",
    "He said that he had been waiting for you so long"
  ],
  [
    "В его комнате три плаката",
    "There are three posters in his room"
  ],
  [
    "В моем кабинете есть письменный стол и два стула",
    "There is a desk and two chairs in my study"
  ],
  [
    "Я не устал этим заниматься",
    "I didn't get tired of doing it"
  ]
]