[
  [
    "На следующей неделе у них будет большая вечеринка",
    "They are having a big party next week"
  ],
  [
    "Я читал эту книгу четыре раза",
    "I have read this book four times"
  ],
  [
    "Она сказала, что она купила новое платье",
    "She said that she had bought a new dress"
  ],
  [
    "Он обычно ест бутерброды на завтрак",
    "He usually eats sandwiches for breakfast"
  ],
  [
    "Сегодня ей предложили новую работу",
    "She has been offered a new job today"
  ],
  [
    "Она сменила прическу",
    "She changed her hairstyle"
  ],
  [
    "Они все обсудили к четырем часам",
    "They had discussed everything by four"
  ],
  [
    "Она сказала нам, что уже была в Англии",
    "She told us that she had already been to England"
  ],
  [
    "Он ушел в школу еще до того, как мы вернулись домой",
    "He had gone to school before we came home"
  ],
  [
    "Он сказал мне, что выиграл этот турнир",
    "He told me that he had won this tournament"
  ],
  [
    "Что ты делаешь сегодня вечером?",
    "What are you doing tonight?"
  ],
  [
    "Это предложение кажется непривлекательным",
    "This offer seems unattractive"
  ],
  [
    "Я вижу у тебя новая стрижка",
    "I see you have a new haircut"
  ],
  [
    "Давай сделаем перерыв!",
    "Let's have a break!"
  ],
  [
    "Я слышал это минуту назад",
    "I heard it a minute ago"
  ],
  [
    "Он ест бутерброд",
    "He is eating a sandwich"
  ],
  [
    "Вчера ей предложили новую работу",
    "She was offered a new job yesterday"
  ],
  [
    "Я только что услышал это в новостях",
    "I have just heard it on the news"
  ],
  [
    "Как давно она здесь работает?",
    "How long has she been working here?"
  ],
  [
    "Он положил руку ей на плечо",
    "He laid his hand on her shoulder"
  ],
  [
    "Ты всегда такой энергичный",
    "You are always so energetic"
  ],
  [
    "Если что-то изменится, я дам тебе знать",
    "If something changes, I will let you know"
  ],
  [
    "Глобализация происходит везде в наше время",
    "Globalization is taking place everywhere nowadays"
  ],
  [
    "Ты хочешь стать миллиардером?",
    "Do you want to become a billionaire?"
  ],
  [
    "Они женаты двадцать лет",
    "They have been married for twenty years"
  ],
  [
    "Когда ты потерял свой кошелек?",
    "When did you lose your wallet?"
  ],
  [
    "Билл обычно ходит на прогулку вечером",
    "Bill usually goes for a walk in the evening"
  ],
  [
    "Он пришел домой, взял свой зонтик и вышел",
    "He came home, took his umbrella and went out"
  ],
  [
    "Сколько раз ты был там?",
    "How many times have you been there?"
  ],
  [
    "У меня сегодня вечером деловая встреча",
    "I'm having a business meeting tonight"
  ],
  [
    "Когда я позвонил ему, он спал",
    "When I called him, he was sleeping"
  ],
  [
    "Мы прекрасно провели время вчера",
    "We had a great time yesterday"
  ],
  [
    "Завтра в это время я буду делать покупки",
    "This time tomorrow I will be doing the shopping"
  ],
  [
    "Это самая вкусная еда, которую я когда-либо пробовал",
    "It's the most delicious food I've ever tasted"
  ],
  [
    "Он сбил другого мужчину, пока ехал на работу",
    "He hit another man while he was driving to work"
  ],
  [
    "Я впервые опаздываю на урок английского",
    "It is the first time I have been late for my English class"
  ],
  [
    "Это лучший фильм, который я когда-либо видел",
    "It's the best movie I've ever seen"
  ],
  [
    "Это лучшая книга, которую я когда-либо читал",
    "It's the best book I've ever read"
  ],
  [
    "Это лучший фильм, который я когда-либо смотрел",
    "It's the best movie we have ever watched"
  ],
  [
    "Когда ты осознал, что мотоцикл исчез?",
    "When did you realise that the bike had disappeared?"
  ],
  [
    "Когда ты понял, что твой бумажник исчез?",
    "When did you understand that your wallet had disappeared?"
  ],
  [
    "Я вдруг осознал, что моя машина исчезла",
    "I suddenly realised that my car had disappeared"
  ],
  [
    "Она присоединится к нам, как только закончит это",
    "She will join us as soon as she finishes it"
  ],
  [
    "Она присоединится к нам как можно скорее",
    "She will join us as soon as possible"
  ],
  [
    "Когда она присоединится к нам?",
    "When will she join us?"
  ],
  [
    "Я уверен, что успешно сдам этот экзамен",
    "I'm sure that I will pass this exam successfully"
  ],
  [
    "Я уверен, что получу эту работу",
    "I'm sure that I will get this job"
  ],
  [
    "Я не уверен, что сдам этот тест",
    "I'm not sure that I will pass this test"
  ],
  [
    "Я шел по улице, когда внезапно увидел его",
    "I was walking along the street when I saw him suddenly"
  ],
  [
    "Я гулял в парке, когда я внезапно увидел ее",
    "I was walking in the park when I saw her suddenly"
  ],
  [
    "Я шел вдоль реки, когда внезапно услышал это",
    "I was walking along the river when I heard it suddenly"
  ],
  [
    "Я впервые в этом месте",
    "It is the first time I have been to this place"
  ],
  [
    "Это был первый раз, когда я был в этом городе",
    "It was the first time I had been to this city"
  ],
  [
    "Это второй раз, когда я в Англии",
    "It is the second time I have been to England"
  ],
  [
    "Мы шли вдоль реки, когда начался дождь",
    "We were walking along the river when it started raining"
  ],
  [
    "Мы лежали на пляже, когда начался дождь",
    "We were lying on the beach when it started raining"
  ],
  [
    "Я гулял в лесу, когда пошел снег",
    "I was walking in the forest when it started snowing"
  ],
  [
    "Он потратит эти деньги к концу недели",
    "He will have spent this money by the end of the week"
  ],
  [
    "Ты когда-нибудь видел какие-либо из этих фильмов?",
    "Have you ever seen any of these movies?"
  ],
  [
    "Он никогда не водил машину, но он хочет учиться",
    "He has never driven a car but he wants to learn"
  ],
  [
    "Если его головная боль исчезнет, он пойдет в кино",
    "If his headache disappears, he will go to the cinema"
  ]
]