[
  [
    "Если бы у него бы миллион, он бы купил огромную машину",
    "If he had one million, he would buy a huge car"
  ],
  [
    "Если бы это было дешевле, я бы купил это",
    "If it were cheaper, I would buy it"
  ],
  [
    "Я мог бы путешествовать, если бы я был богат",
    "I could travel if I were rich"
  ],
  [
    "Я желаю, чтобы у меня было больше денег",
    "I wish I had more money"
  ],
  [
    "Я желаю, чтобы ты был здесь",
    "I wish you were here"
  ],
  [
    "На твоем месте, я бы так не волновался об этом",
    "If I were you, I wouldn't worry about it so much"
  ],
  [
    "Что бы ты сделал, если бы ты был на моем месте?",
    "What would you do if you were in my place?"
  ],
  [
    "Я желаю, чтобы у меня было больше свободного времени",
    "I wish I had more free time"
  ],
  [
    "Я желаю, чтобы я знал правильный ответ",
    "I wish I knew the correct answer"
  ],
  [
    "Я желаю, чтобы я имел продвинутый уровень сейчас",
    "I wish I had an Advanced level now"
  ],
  [
    "Я желаю, чтобы все были счастливы",
    "I wish everyone were happy"
  ],
  [
    "Если бы погода была лучше, мы пошли бы в парк",
    "If the weather were better, we would go to the park"
  ],
  [
    "Если бы это было дешевле, я бы купил",
    "If it were cheaper, I would buy it"
  ],
  [
    "Я бы сделал это, если бы у меня было больше свободного времени",
    "I would do it if I had more free time"
  ],
  [
    "Я желаю, чтобы я мог ей помочь",
    "I wish I could help her"
  ],
  [
    "Я желаю, чтобы я был богатым",
    "I wish I were rich"
  ],
  [
    "Она желает, чтобы она была знаменитой",
    "She wishes she were famous"
  ],
  [
    "Я желаю, чтобы знал это",
    "I wish I knew it"
  ],
  [
    "Я желаю, чтобы я был врачом",
    "I wish I were a doctor"
  ],
  [
    "Я желаю, чтобы я имел работу лучше",
    "I wish I had a better job"
  ],
  [
    "Если бы я выиграл в лотерею, я бы купил квартиру",
    "If I won the lottery, I would buy an apartment"
  ],
  [
    "Если бы я был моложе, то мог бы работать гораздо больше",
    "If I were younger, I could work much more"
  ],
  [
    "Я желаю, чтобы было меньше бумажной работы",
    "I wish there were less paperwork"
  ],
  [
    "Если бы он был моложе, он бы путешествовал больше",
    "If he were younger, he would travel more"
  ],
  [
    "Если бы он выиграл в лотерею, он купил бы дом",
    "If he won the lottery, he would buy a house"
  ],
  [
    "Если бы он был моложе, он мог бы идти быстрее",
    "If he were younger, he could walk faster"
  ],
  [
    "Я бы выучил английский, если бы знал это",
    "I would learn English if I knew it"
  ],
  [
    "Я желаю, что бы у меня было меньше бумажной работы",
    "I wish I had less paperwork"
  ],
  [
    "На твоем месте, я бы сделал то же самое",
    "If I were you, I would do the same"
  ],
  [
    "Он желает, чтобы он был бизнесменом",
    "He wishes he were a businessman"
  ],
  [
    "Я желаю, чтобы я знал правильный ответ",
    "I wish I knew the right answer"
  ],
  [
    "На твоем месте, я бы сделал другую вещь",
    "If I were you, I would do another thing"
  ],
  [
    "На твоем месте, я бы ей позвонил",
    "If I were you, I would call her"
  ],
  [
    "Если бы я знал ее номер телефона, я бы позвонил ей",
    "If I knew her phone number, I would call her"
  ],
  [
    "На твоем месте, я бы бросил курить",
    "If I were you, I would give up smoking"
  ],
  [
    "Я желаю, чтобы я имел эту возможность",
    "I wish I had this opportunity"
  ],
  [
    "Он желает, чтобы он имел больше свободного времени",
    "He wishes he had more free time"
  ],
  [
    "Он желает, чтобы он был миллионером",
    "He wishes he were a millionaire"
  ],
  [
    "Я бы одолжил тебе эти деньги, если бы они у меня были",
    "I would lend you this money if I had it"
  ],
  [
    "Я желаю, чтобы я жил ближе к этому месту",
    "I wish I lived closer to this place"
  ],
  [
    "Я желаю, чтобы было меньше бедных людей",
    "I wish there were fewer poor people"
  ],
  [
    "Даже если бы у меня были деньги, я бы это не купил",
    "Even if I had money, I wouldn't buy it"
  ],
  [
    "Я желаю, чтобы в нашем мире было меньше агрессии",
    "I wish there were less aggression in our world"
  ],
  [
    "Что бы ты сделал, если бы выиграл миллион долларов?",
    "What would you do if you won a million dollars?"
  ],
  [
    "Я желаю, чтобы в мире не было несправедливости",
    "I wish there were no injustice in the world"
  ],
  [
    "Я желаю, чтобы вокруг было больше справедливости",
    "I wish there were more justice around"
  ],
  [
    "Я желаю, чтобы в мире не было преступлений",
    "I wish there were no crimes in the world"
  ],
  [
    "Я был бы признателен тебе, если ты это сделаешь",
    "I would be grateful to you if you did it"
  ],
  [
    "Я был бы счастлив, если бы ты дал это мне",
    "I would be happy if you gave it to me"
  ],
  [
    "Я был бы признателен тебе, если бы ты помог мне",
    "I would be grateful to you if you helped me"
  ],
  [
    "Я желаю, чтобы в мире было больше справедливости",
    "I wish there were more justice in the world"
  ],
  [
    "Я желаю, чтобы у него было больше терпения",
    "I wish he had more patience"
  ],
  [
    "Я желаю, чтобы вокруг не было несправедливости",
    "I wish there were no injustice around"
  ],
  [
    "Если бы у него был миллион фунтов, он бы купил яхту",
    "If he had one million pounds, he would buy a yacht"
  ],
  [
    "Если бы он был богатым, он купил бы все эти вещи",
    "If he were rich, he would buy all these things"
  ],
  [
    "Что бы ты сделал, если бы ты был олигархом?",
    "What would you do if you were an oligarch?"
  ],
  [
    "Что бы ты сделал, если бы ты был богатым?",
    "What would you do if you were rich?"
  ],
  [
    "Я бы не купил эту вещь, если бы она мне не была нужна",
    "I wouldn't buy this thing if I didn’t need it"
  ],
  [
    "Я бы купил эту вещь, если бы она мне понадобилась",
    "I would buy this thing if I needed it"
  ],
  [
    "Я бы не купил эту машину, если бы она мне не нравилась",
    "I wouldn't buy this car if I didn't like it"
  ],
  [
    "Я желаю, чтобы не было преступлений",
    "I wish there were no crimes"
  ],
  [
    "Я желаю, чтобы не было несправедливости",
    "I wish there were no injustice"
  ],
  [
    "Я желаю, чтобы не было преступников",
    "I wish there were no criminals"
  ],
  [
    "Что бы ты сделал, если бы был миллионером?",
    "What would you do if you were a millionaire?"
  ],
  [
    "Что бы она сделала, если бы была миллиардером?",
    "What would she do if she were a billionaire?"
  ],
  [
    "Он желает быть миллиардером",
    "He wishes he were a billionaire"
  ],
  [
    "Он желает быть очень богатым",
    "He wishes he were very rich"
  ],
  [
    "Он желает, чтобы он был действительно счастлив",
    "He wishes he were really happy"
  ],
  [
    "Я желаю, чтобы у меня была выше зарплата",
    "I wish I had a higher salary"
  ],
  [
    "Я желаю, чтобы в мире была только справедливость",
    "I wish there were only justice in the world"
  ],
  [
    "Я желаю, чтобы я жил в сельской местности",
    "I wish I lived in the countryside"
  ],
  [
    "Я желаю, чтобы у меня был более гибкий график",
    "I wish I had a more flexible schedule"
  ],
  [
    "На твоем месте, я бы попробовал бросить курить",
    "If I were you, I would try to give up smoking"
  ],
  [
    "Он написал бы ей, если бы он знал ее адрес",
    "He would write to her if he knew her address"
  ],
  [
    "Я желаю, чтобы я жил рядом с этим местом",
    "I wish I lived near this place"
  ],
  [
    "Что бы ты сделал, если бы был миллиардером?",
    "What would you do if you were a billionaire?"
  ],
  [
    "Я желаю, чтобы в мире было меньше несправедливости",
    "I wish there were less injustice in the world"
  ],
  [
    "Я желаю, чтобы это было возможно",
    "I wish it were possible"
  ],
  [
    "Я бы не купил этот дом, если бы он мне не был нужен",
    "I wouldn't buy this house if I didn't need it"
  ]
]