[
  [
    "Я помогу тебе, если ты попросишь меня",
    "I will help you if you ask me"
  ],
  [
    "Если это произойдет, я буду счастлив",
    "If it happens, I will be happy"
  ],
  [
    "Если ты готов, мы можем начать встречу",
    "If you are ready, we can start the meeting"
  ],
  [
    "Если бы только у меня было достаточно доказательств",
    "If only I had enough proofs"
  ],
  [
    "Если я выиграю в лотерею, я куплю что-нибудь для себя",
    "If I win the lottery, I will buy something for myself"
  ],
  [
    "Если бы я только знал это",
    "If only I knew it"
  ],
  [
    "На твоем месте, я бы начал сейчас",
    "If I were you, I would start now"
  ],
  [
    "Она желает, чтобы она умела танцевать лучше",
    "She wishes she could dance better"
  ],
  [
    "На твоем месте я бы принял это предложение",
    "If I were you, I would take this offer"
  ],
  [
    "Если пойдет дождь, я не пойду в парк",
    "If it rains, I won't go to the park"
  ],
  [
    "Если бы я был готов к этому экзамену, я бы сдал его",
    "If I were ready for this exam, I would pass it"
  ],
  [
    "Если бы он был голоден, он бы съел бутерброд",
    "If he were hungry, he would eat a sandwich"
  ],
  [
    "Подожди меня, пока я не вернусь",
    "Wait for me until I come back"
  ],
  [
    "Я дам тебе знать, когда я буду готов",
    "I will let you know when I get ready"
  ],
  [
    "Если он будет учиться лучше, то получит лучше оценки",
    "If he studies better, he will get better marks"
  ],
  [
    "Дверь откроется после того, как ты нажмешь на кнопку",
    "The door will open after you press the button"
  ],
  [
    "Я желаю, чтобы сейчас было лето",
    "I wish it were summer now"
  ],
  [
    "Я скажу тебе, когда я буду готов",
    "I will tell you when I'm ready"
  ],
  [
    "Он будет очень удивлен, когда узнает это",
    "He will be very surprised when he knows it"
  ],
  [
    "Если бы только у меня были эти знания",
    "If only I had this knowledge"
  ],
  [
    "Подожди здесь, пока я вернусь",
    "Wait here till I come back"
  ],
  [
    "Я желаю, чтобы ты был здесь сейчас",
    "I wish you were here now"
  ],
  [
    "Если бы еда не была плохой, они бы не жаловались",
    "If the food weren't bad, they wouldn't complain"
  ],
  [
    "Если я буду богат, моя жизнь полностью изменится",
    "If I am rich, my life will change completely"
  ],
  [
    "Если бы он был моим другом, я бы пригласил его",
    "If he were my friend, I would invite him"
  ],
  [
    "Если бы только ты был здесь",
    "If only you were here"
  ],
  [
    "Я куплю ноутбук, когда заработаю эти деньги",
    "I will buy a laptop when I earn this money"
  ],
  [
    "Если ты занят, я не буду тебе мешать",
    "If you are busy, I won't disturb you"
  ],
  [
    "Если бы только у меня было больше свободного времени",
    "If only I had more free time"
  ],
  [
    "Я желаю, чтобы все это знали",
    "I wish everyone knew it"
  ],
  [
    "Если поезд задержат, мы опоздаем",
    "If the train is delayed, we will be late"
  ],
  [
    "Что ты будешь делать, если ты станешь миллионером?",
    "What will you do if you become a millionaire?"
  ],
  [
    "Я желаю, чтобы было двадцать пять часов в сутках",
    "I wish there were twenty five hours in a day"
  ],
  [
    "Если ты хочешь купить билет, купи его",
    "If you want to buy a ticket, buy it"
  ],
  [
    "Что бы ты сделал на моем месте?",
    "What would you do if you were me?"
  ],
  [
    "Что бы ты сделал, если бы ты стал миллионером?",
    "What would you do if you became a millionaire?"
  ],
  [
    "Она будет шокирована, когда выяснит правду",
    "She will be shocked when she finds out the truth"
  ],
  [
    "Ты не успеешь на автобус, если не поторопишься",
    "You won't catch the bus if you don't hurry up"
  ],
  [
    "Ты подождешь меня, если я немного опоздаю?",
    "Will you wait for me if I'm late a little?"
  ],
  [
    "Мне нужно сделать все, прежде чем это произойдет",
    "I need to do everything before it happens"
  ],
  [
    "Мне нужно сделать это, прежде чем он придет",
    "I need to do it before he comes"
  ],
  [
    "Мне нужно сделать все, прежде чем я вернусь домой",
    "I need to do everything before I return home"
  ],
  [
    "Если бы только у меня был еще один шанс",
    "If only I had one more chance"
  ],
  [
    "Если бы только у меня был последний шанс",
    "If only I had the last chance"
  ],
  [
    "Если бы только у меня было больше денег",
    "If only I had more money"
  ],
  [
    "Если бы я только мог позволить себе купить это",
    "If only I could afford to buy it"
  ],
  [
    "Если бы я только мог купить это",
    "If only I could buy it"
  ],
  [
    "Если бы я только мог найти это",
    "If only I could find it"
  ],
  [
    "Если бы он только знал, как это интересно",
    "If only he knew how interesting it is"
  ],
  [
    "Если бы ты только знал, насколько это важно",
    "If only you knew how important it is"
  ],
  [
    "Если бы ты только понимал, как это было важно",
    "If only you understood how important it was"
  ],
  [
    "Что ты будешь делать после того, как это произойдет?",
    "What will you do after this thing happens?"
  ],
  [
    "Что ты будешь делать после того, как он придет?",
    "What will you do after he comes?"
  ],
  [
    "Что он скажет после того, как это произойдет?",
    "What will he say after this thing happens?"
  ],
  [
    "Если ты хочешь сделать это, сделай это сейчас",
    "If you want to do it, do it now"
  ],
  [
    "Если ты хочешь купить это, покупай сейчас",
    "If you want to buy it, buy it now"
  ],
  [
    "Если бы я только мог это увидеть",
    "If only I could see it"
  ],
  [
    "Если бы я только мог это сделать",
    "If only I could do it"
  ],
  [
    "Если тебе нужна моя помощь, дай мне знать",
    "If you need my help, let me know"
  ],
  [
    "Если тебе нужна моя поддержка, дай мне знать",
    "If you need my support, let me know"
  ],
  [
    "Если тебе нужен мой совет, дай мне знать",
    "If you need my advice, let me know"
  ],
  [
    "Если бы я только мог повернуть время вспять",
    "If only I could turn back time"
  ],
  [
    "Если бы я только мог вернуться домой",
    "If only I could come back home"
  ],
  [
    "Если бы я только мог все изменить",
    "If only I could change everything"
  ],
  [
    "Что ты будешь делать, если это произойдет?",
    "What will you do if it happens?"
  ],
  [
    "Что ты скажешь, если он спросит?",
    "What will you say if he asks?"
  ],
  [
    "Что ты купишь, если он одолжит тебе немного денег?",
    "What will you buy if he lends you some money?"
  ],
  [
    "Если бы только у меня была еще одна попытка",
    "If only I had one more attempt"
  ],
  [
    "Я желаю, чтобы я мог тратить больше времени на это",
    "I wish I could spend more time on it"
  ],
  [
    "Она была бы в шоке, если бы узнала правду",
    "She would be shocked, if she found out the truth"
  ],
  [
    "Я желаю, чтобы у меня была память получше",
    "I wish I had a better memory"
  ],
  [
    "Она будет в шоке, когда узнает это",
    "She will be shocked when she finds it out"
  ],
  [
    "Если бы я только мог вернуть это время",
    "If only I could get this time back"
  ]
]