[
  [
    "Ты знаешь, какое у него имя?",
    "Do you know what his name is?"
  ],
  [
    "Скажи мне, где они!",
    "Tell me where they are!"
  ],
  [
    "Я хотел бы знать, откуда он",
    "I'd like to know where he is from"
  ],
  [
    "Ты можешь сказать мне, сколько это стоит?",
    "Can you tell me how much it is?"
  ],
  [
    "Ты можешь сказать мне, где документы?",
    "Can you tell me where the documents are?"
  ],
  [
    "Я осознаю, насколько это опасно",
    "I realise how dangerous it is"
  ],
  [
    "Ты можешь сказать мне, почему ты отсутствовал вчера?",
    "Can you tell me why you were absent yesterday?"
  ],
  [
    "Ты можешь сказать мне, который час?",
    "Can you tell me what time it is?"
  ],
  [
    "Я действительно вижу, как великолепно это место",
    "I really see how magnificent this place is"
  ],
  [
    "Ты можешь сказать мне, где эта улица?",
    "Can you tell me where this street is?"
  ],
  [
    "Ты знаешь, почему это произошло?",
    "Do you know why it happened?"
  ],
  [
    "Ты знаешь, как быстрее добраться до этого места?",
    "Do you know how to get to this place more quickly?"
  ],
  [
    "Ты мог бы сказать мне, где находится станция?",
    "Could you tell me where the station is?"
  ],
  [
    "Ты знаешь, где находится ближайший супермаркет?",
    "Do you know where the nearest supermarket is?"
  ],
  [
    "Я понимаю, как это ответственно",
    "I understand how responsible it is"
  ],
  [
    "Ты знаешь, во сколько магазин открывается?",
    "Do you know what time the shop opens?"
  ],
  [
    "Я хотел бы знать, откуда она",
    "I'd like to know where she is from"
  ],
  [
    "Где станция?",
    "Where is the station?"
  ],
  [
    "Что он делает?",
    "What is he doing?"
  ],
  [
    "Который сейчас час?",
    "What time is it?"
  ],
  [
    "Ты знаешь, когда этот поезд отправляется?",
    "Do you know when this train departs?"
  ],
  [
    "Я не знаю где это",
    "I don't know where it is"
  ],
  [
    "Ты знаешь, что он делает?",
    "Do you know what he is doing?"
  ],
  [
    "Я вижу, насколько эффективный этот курс",
    "I see how effective this course is"
  ],
  [
    "Ты знаешь, как его зовут?",
    "Do you know what his name is?"
  ],
  [
    "Почему ты вчера отсутствовал?",
    "Why were you absent yesterday?"
  ],
  [
    "Почему это произошло?",
    "Why did it happen?"
  ],
  [
    "Ты знаешь, как далеко это место?",
    "Do you know how far is this place?"
  ],
  [
    "Ты мог бы сказать мне, когда прибудет этот поезд?",
    "Could you tell me when this train arrives?"
  ],
  [
    "Я хотел бы знать, сколько это стоит",
    "I'd like to know how much it costs"
  ],
  [
    "Я действительно вижу, насколько эффективный этот метод",
    "I really see how effective this method is"
  ],
  [
    "Ты мог бы сказать мне, где находится почтовое отделение?",
    "Could you tell me where the post office is?"
  ],
  [
    "Я хотел бы знать, почему ты так думаешь",
    "I'd like to know why you think so"
  ],
  [
    "Ты знаешь, в какое время супермаркет закрывается?",
    "Do you know what time the supermarket closes?"
  ],
  [
    "Ты знаешь, где находится ближайший банк?",
    "Do you know where the nearest bank is?"
  ],
  [
    "Ты знаешь, где находится универмаг?",
    "Do you know where the department store is?"
  ],
  [
    "Я не знаю сколько это может стоить",
    "I don't know how much it can cost"
  ],
  [
    "У тебя есть какая-либо идея, почему это так?",
    "Do you have any idea why it is so?"
  ],
  [
    "Ты знаешь, когда прибывает следующий поезд?",
    "Do you know when the next train arrives?"
  ],
  [
    "Ты знаешь, что означает это выражение?",
    "Do you know what this expression means?"
  ],
  [
    "Он не понимает, насколько это важно",
    "He doesn't understand how important it is"
  ],
  [
    "Интересно, кто стоит за этим",
    "I wonder who stands behind it"
  ],
  [
    "Он хочет знать, почему ты опоздал на работу",
    "He wants to know why you were late for work"
  ],
  [
    "Они действительно не осознают, насколько это важно",
    "They don't really realise how important it is"
  ],
  [
    "Как празднуется Рождество в Европе?",
    "How is Christmas celebrated in Europe?"
  ],
  [
    "Я не знаю, почему она опоздала в школу",
    "I don't know why she was late for school"
  ],
  [
    "Ты знаешь, кто автор этой книги?",
    "Do you know who the author of this book is?"
  ],
  [
    "Ты можешь сказать мне, что на обед?",
    "Can you tell me what is for lunch?"
  ],
  [
    "Ты можешь сказать мне, где находится класс?",
    "Can you tell me where the classroom is?"
  ],
  [
    "Когда ресторан открыт?",
    "When is the restaurant open?"
  ],
  [
    "Есть какой-либо шанс, что это произойдет?",
    "Is there any chance that it will happen?"
  ],
  [
    "Какая главная причина ее отказа?",
    "What's the main reason for her refusal?"
  ],
  [
    "Я не знаю, что будет на ужин",
    "I don't know what will be for dinner"
  ],
  [
    "Я не знаю, как долго будет длиться встреча",
    "I don't know how long the meeting will last"
  ],
  [
    "Я не знаю, как долго будет длиться эта конференция",
    "I don't know how long this conference will last"
  ],
  [
    "Я знаю, как долго продлится этот фильм",
    "I know how long this movie will last"
  ],
  [
    "Я понятия не имею, почему это происходит",
    "I have no idea why it happens"
  ],
  [
    "Я понятия не имею, почему это произошло",
    "I have no idea why it happened"
  ],
  [
    "Я понятия не имею, почему он это делает",
    "I have no idea why he does it"
  ],
  [
    "Ты знаешь, сколько времени занимает сделать это?",
    "Do you know how long it takes to do it?"
  ],
  [
    "Ты знаешь, когда ресторан открыт?",
    "Do you know when the restaurant is open?"
  ],
  [
    "Ты знаешь, когда этот магазин открыт?",
    "Do you know when this shop is open?"
  ],
  [
    "Ты знаешь, когда музей открыт?",
    "Do you know when the museum is open?"
  ],
  [
    "Кто автор этой книги?",
    "Who is the author of this book?"
  ],
  [
    "Он автор той книги",
    "He is the author of that book"
  ],
  [
    "Кто автор статьи?",
    "Who is the author of the article?"
  ],
  [
    "Как этот праздник отмечается в твоей стране?",
    "How is this holiday celebrated in your country?"
  ],
  [
    "Как Рождество празднуется в твоей родной стране?",
    "How is Christmas celebrated in your country?"
  ],
  [
    "Когда этот праздник отмечается в Европе?",
    "When is this holiday celebrated in Europe?"
  ],
  [
    "Почему ты опоздал на работу?",
    "Why were you late for work?"
  ],
  [
    "Интересно, почему рейс был задержан?",
    "I wonder why the flight was delayed"
  ],
  [
    "Я знаю, почему рейс был задержан",
    "I know why the flight was delayed"
  ],
  [
    "Интересно, почему он опоздал на работу?",
    "I wonder why he was late for work"
  ],
  [
    "Я не знаю, почему он бросил свою прошлую работу",
    "I don't know why he quit his last job"
  ],
  [
    "Ты можешь сказать мне, почему ты опоздал?",
    "Can you tell me why you were late?"
  ],
  [
    "Я не знаю что будет на ужин",
    "I don't know what will be for supper"
  ],
  [
    "Я не знаю, в чем была причина его отказа",
    "I don't know what the reason for his refusal was"
  ],
  [
    "Интересно, кто собирается прийти",
    "I wonder who is going to come"
  ],
  [
    "Я не знаю, кто автор этой книги",
    "I don't know who the author of this book is"
  ],
  [
    "Ты знаешь, как празднуется Рождество в России?",
    "Do you know how Christmas is celebrated in Russia?"
  ],
  [
    "Почему ты бросил свою последнюю работу?",
    "Why did you quit your last job?"
  ],
  [
    "Я хотел бы знать, как задать косвенный вопрос",
    "I'd like to know how to ask an indirect question"
  ],
  [
    "Я не знаю, в чем была причина",
    "I don't know what the reason was"
  ],
  [
    "Я не знаю, почему он опоздал на работу",
    "I don't know why he was late for work"
  ],
  [
    "Где классная комната?",
    "Where is the classroom?"
  ],
  [
    "Как долго будет длиться встреча?",
    "How long will the meeting last?"
  ],
  [
    "Какова была причина этого?",
    "What was the reason for it?"
  ],
  [
    "Ты знаешь, что это значит?",
    "Do you know what it means?"
  ],
  [
    "Интересно, сколько сейчас времени?",
    "I wonder what time it is now"
  ]
]