[
  [
    "Изучение английского языка кажется очень полезным",
    "Learning English seems very useful"
  ],
  [
    "Чтение книг является моим хобби",
    "Reading books is my hobby"
  ],
  [
    "Я действительно рад видеть тебя",
    "I am really glad to see you"
  ],
  [
    "Я попросил ее сделать это",
    "I asked her to do it"
  ],
  [
    "Моя мечта знать хотя бы три иностранных языка",
    "My dream is to know at least three foreign languages"
  ],
  [
    "Зарабатывать много денег - одно из его мечтаний",
    "Earning lots of money is one of his dreams"
  ],
  [
    "Ты можешь сказать мне, когда тебе звонить?",
    "Can you tell me when to call you?"
  ],
  [
    "Я хочу знать по крайней мере два иностранных языка",
    "I want to know at least two foreign languages"
  ],
  [
    "Часто бывает трудно понимать английский",
    "It is often difficult to understand English"
  ],
  [
    "Я действительно рад тебя видеть",
    "I am really glad to see you"
  ],
  [
    "Он не знает, как открыть дверь",
    "He doesn't know how to open the door"
  ],
  [
    "Я не знаю, где найти эти файлы",
    "I don't know where to find these files"
  ],
  [
    "Я могу слушать эти видео, занимаясь другими вещами",
    "I can listen to these videos doing other things"
  ],
  [
    "Он остановился, чтобы сделать звонок",
    "He stopped to make a phone call"
  ],
  [
    "Это очень легко сказать, но это не так легко сделать",
    "It's very easy to say it but it isn't so easy to do it"
  ],
  [
    "Чтение книг часто кажется скучным",
    "Reading books often seems boring"
  ],
  [
    "Я звоню тебе, чтобы поговорить об этом",
    "I'm calling you to talk about it"
  ],
  [
    "Я с нетерпением жду встречи с тобой снова",
    "I look forward to meeting you again"
  ],
  [
    "Это была хорошая идея сделать это",
    "It was a good idea to do it"
  ],
  [
    "Я остановился, чтобы сделать звонок",
    "I stopped to make a call"
  ],
  [
    "Она любит бегать трусцой",
    "She likes going jogging"
  ],
  [
    "Так чудесно видеть тебя снова",
    "It's so wonderful to see you again"
  ],
  [
    "Чрезвычайно важно помнить это",
    "It's extremely important to remember it"
  ],
  [
    "Я попросил ее не делать этого",
    "I asked her not to do it"
  ],
  [
    "Трудно ответить на этот вопрос прямо сейчас",
    "It's difficult to answer this question right now"
  ],
  [
    "Тебе нравится ходить на рыбалку?",
    "Do you like going fishing?"
  ],
  [
    "Жить одному - это не для каждого",
    "Living alone isn't for everyone"
  ],
  [
    "Стать миллионером - это его мечта",
    "Becoming a millionaire is his dream"
  ],
  [
    "Это было мудрое решение сделать это заранее",
    "It was a wise decision to do it beforehand"
  ],
  [
    "Моя мечта - иметь много времени",
    "My dream is to have plenty of time"
  ],
  [
    "Его мечта - стать успешным и независимым",
    "His dream is to become successful and independent"
  ],
  [
    "Мне не нравится ходить по магазинам",
    "I don't like going shopping"
  ],
  [
    "Его мечта - заработать множество денег",
    "His dream is to earn plenty of money"
  ],
  [
    "Я пришел сюда, чтобы увидеть тебя",
    "I came here to see you"
  ],
  [
    "Он часто катается на лыжах",
    "He often goes skiing"
  ],
  [
    "Я мечтаю достичь самого высокого уровня в английском",
    "It's my dream to reach the highest level in English"
  ],
  [
    "Он часто ходит плавать",
    "He often goes swimming"
  ],
  [
    "Я не уверен, как это сделать лучше",
    "I'm not sure how to do it better"
  ],
  [
    "Это моя самая большая мечта - посетить это место",
    "It's my greatest dream to visit this place"
  ],
  [
    "Приятно видеть тебя снова",
    "It's nice to see you again"
  ],
  [
    "Часто говорят, что ходьба - это хорошее упражнение",
    "It is often said that walking is a good exercise"
  ],
  [
    "Мне нужно все проверить перед выходом",
    "I need to check everything before going out"
  ],
  [
    "Не так легко поступить в престижный университет",
    "It isn't so easy to enter a prestigious university"
  ],
  [
    "Ее зарплата не достаточно велика, чтобы купить квартиру",
    "Her salary isn't big enough to buy an apartment"
  ],
  [
    "Никогда не слишком поздно изменить свою жизнь",
    "It is never too late to change your life"
  ],
  [
    "Это был настоящий сюрприз увидеть ее там",
    "It was a real surprise to see her there"
  ],
  [
    "Это был настоящий сюрприз встретить ее снова",
    "It was a real surprise to meet her again"
  ],
  [
    "Это был сюрприз получить эту посылку",
    "It was a surprise to get this parcel"
  ],
  [
    "Прогулка по парку помогает мне расслабиться",
    "Walking in the park helps me relax"
  ],
  [
    "Чтение книг помогает мне расслабиться",
    "Reading books helps me relax"
  ],
  [
    "Купание в море помогает мне расслабиться",
    "Swimming in the sea helps me relax"
  ],
  [
    "Поступить в престижный университет не так легко",
    "Entering a prestigious university isn't so easy"
  ],
  [
    "Поступить в этот университет не так просто для меня",
    "Entering this university isn't so easy for me"
  ],
  [
    "Что ты собираешься делать после окончания школы?",
    "What are you going to do after finishing school?"
  ],
  [
    "Его доход не достаточно велик, чтобы купить новый дом",
    "His income isn't big enough to buy a new house"
  ],
  [
    "Я часто слышу, что жить в Америке очень дорого",
    "I often hear that living in America is very expensive"
  ],
  [
    "Я думаю, что жить в Америке действительно дорого",
    "I think that living in America is really expensive"
  ],
  [
    "Говорят, что жить в Европе очень дорого",
    "It is said that living in Europe is very expensive"
  ],
  [
    "Было невозможно сделать это",
    "It was impossible to do it"
  ],
  [
    "Это невозможно понять",
    "It is impossible to understand it"
  ],
  [
    "Было невозможно смотреть этот фильм",
    "It was impossible to watch this movie"
  ],
  [
    "Он слишком молод, чтобы иметь машину",
    "He is too young to have a car"
  ],
  [
    "Он очень молод, чтобы водить машину",
    "He is very young to drive a car"
  ],
  [
    "Они слишком молоды, чтобы жениться",
    "They are too young to marry"
  ],
  [
    "Никогда не поздно учиться",
    "It is never too late to learn"
  ],
  [
    "Никогда не поздно учиться чему-то новому",
    "It is never too late to learn something new"
  ],
  [
    "Создать прибыльный бизнес не так легко в наши дни",
    "Creating a profitable business isn't so easy nowadays"
  ],
  [
    "Я хочу сказать, что так замечательно видеть тебя здесь",
    "I want to say that it is so wonderful to see you here"
  ],
  [
    "Не было возможно рассчитать все очень точно",
    "It wasn't possible to calculate everything very accurately"
  ],
  [
    "Проверь все перед выходом",
    "Check everything before going out"
  ],
  [
    "Мы можем сделать гораздо больше, имея эту статистику",
    "We can do much more having these statistics"
  ]
]