[
  [
    "Я бы на это не рассчитывал на твоем месте",
    "I wouldn't count on it in your place"
  ],
  [
    "Как он живёт на такой маленький доход?",
    "How does he get by on such a small income?"
  ],
  [
    "Он подобрал банкноту",
    "He picked up a banknote"
  ],
  [
    "Почему мы не можем рассчитывать на эту поддержку?",
    "Why can't we count on this support?"
  ],
  [
    "Я списал эту неудачу на его неопытность",
    "I put down this failure to his inexperience"
  ],
  [
    "Она выдумала эту историю",
    "She made up this story"
  ],
  [
    "Грабителям не удалось уйти",
    "The robbers didn't manage to get away"
  ],
  [
    "Студент встал и задал ей вопрос",
    "A student stood up and asked her a question"
  ],
  [
    "Я действительно сыт по горло этими ложными обещаниями",
    "I am really fed up with these false promises"
  ],
  [
    "Тебе нужно составить свои собственные предложения",
    "You need to make up your own sentences"
  ],
  [
    "Он так невнимателен, и я списал это на его усталость",
    "He is so inattentive and I put it down to his tiredness"
  ],
  [
    "Ученый выдвинул очень интересную идею",
    "The scientist put forward a very interesting idea"
  ],
  [
    "Так много деревьев вырубается каждый день",
    "So many trees are cut down every day"
  ],
  [
    "Она подобрала монету",
    "She picked up a coin"
  ],
  [
    "Как вор проник в дом?",
    "How did the thief get into the house?"
  ],
  [
    "Я списал это на его лень",
    "I put it down to his laziness"
  ],
  [
    "Он потушил огонь",
    "He put out the fire"
  ],
  [
    "Я решил продолжать это делать",
    "I made up my mind to go on doing it"
  ],
  [
    "Я действительно сыт этим по горло",
    "I am really fed up with it"
  ],
  [
    "Почему мы не можем на это рассчитывать?",
    "Why can't we count on it?"
  ],
  [
    "Он скоро с этим справится",
    "He will get over it soon"
  ],
  [
    "Я решил сесть, потому что я очень устал",
    "I decided to sit down because I was very tired"
  ],
  [
    "Он ушел от толпы",
    "He got away from the crowd"
  ],
  [
    "Я не могу понять, что происходит",
    "I can't make out what is going on"
  ],
  [
    "Взбодрись!",
    "Cheer up!"
  ],
  [
    "Он попал в беду",
    "He got into trouble"
  ],
  [
    "Он отдал свои старые книги",
    "He gave away his old books"
  ],
  [
    "Он потушил сигарету",
    "He put out a cigarette"
  ],
  [
    "Она справляется с этой болезнью",
    "She is getting over this illness"
  ],
  [
    "Я списал его плохое настроение на усталость",
    "I put his bad mood down to tiredness"
  ],
  [
    "Я не могу понять, что она говорит",
    "I can't make out what she is saying"
  ],
  [
    "Эти деревья были срублены",
    "These trees were cut down"
  ],
  [
    "Они провели опрос",
    "They carried out a survey"
  ],
  [
    "Он думает, что она попала в беду",
    "He thinks she got into trouble"
  ],
  [
    "Он сказал ей взбодриться",
    "He told her to cheer up"
  ],
  [
    "Он решил сократить потребление алкоголя",
    "He decided to cut down on drinking alcohol"
  ],
  [
    "Он справился с гриппом",
    "He got over the flu"
  ],
  [
    "Я действительно сыт всем этим по горло",
    "I'm really fed up with all this"
  ],
  [
    "Я заберу его после школы",
    "I will pick him up after school"
  ],
  [
    "На такую низкую зарплату почти невозможно выжить",
    "It's almost impossible to get by on such a low salary"
  ],
  [
    "Ты мог бы соединить меня с директором?",
    "Could you put me through to the director?"
  ],
  [
    "Новое расследование было проведено полицией",
    "A new investigation was carried out by the police"
  ],
  [
    "Ты можешь соединить меня с врачом?",
    "Can you put me through to the doctor?"
  ],
  [
    "Я решил сделать это немедленно",
    "I made up my mind to do it immediately"
  ],
  [
    "Я решил попытаться сделать это еще один раз",
    "I made up my mind to try to do it one more time"
  ],
  [
    "Я уже принял решение",
    "I have already made up my mind"
  ],
  [
    "Ей надоело делать одно и то же снова и снова",
    "She got fed up with doing the same things again and again"
  ],
  [
    "Я действительно сыт по горло твоими обещаниями",
    "I am really fed up with your promises"
  ],
  [
    "Я действительно сыт по горло его поведением",
    "I am really fed up with his behaviour"
  ],
  [
    "Когда вор вломился в дом?",
    "When did the thief break into the house?"
  ],
  [
    "Этот план был выдвинут вчера",
    "This plan was put forward yesterday"
  ],
  [
    "Они выдвинули очень интересную идею",
    "They put forward a very interesting idea"
  ],
  [
    "Было выдвинуто очень интересное предложение",
    "A very interesting suggestion was put forward"
  ],
  [
    "Оператор соединил меня с ним",
    "The operator put me through to him"
  ],
  [
    "Ты можешь соединить меня с менеджером?",
    "Can you put me through to the manager?"
  ],
  [
    "Я бы хотел, чтобы ты соединил меня с директором",
    "I would like you to put me through to the director"
  ],
  [
    "Он отдал эти деньги на благотворительность",
    "He gave away this money to charity"
  ],
  [
    "Он отдал свою старую одежду",
    "He gave away his old clothes"
  ],
  [
    "Пожар был потушен пожарной командой",
    "The fire was put out by a fire brigade"
  ],
  [
    "Он потушил огонь?",
    "Did he put out the fire?"
  ],
  [
    "У них ушло около трех часов, чтобы потушить пожар",
    "It took them about three hours to put out the fire"
  ],
  [
    "Он хотел бы, чтобы я связался с ним",
    "He would like me to put through to him"
  ],
  [
    "Ты можешь соединить меня с ней?",
    "Can you put me through to her?"
  ],
  [
    "Я еще не связался с ним",
    "I haven't been put through to him yet"
  ],
  [
    "Я заберу тебя после того, как встреча закончится",
    "I will pick you up after the meeting finishes"
  ],
  [
    "Я заберу тебя после школы",
    "I will pick you up after school"
  ],
  [
    "Когда они тебя заберут?",
    "When will they pick you up?"
  ],
  [
    "Он принял решение меньше курить",
    "He took a decision to cut down on smoking"
  ],
  [
    "Когда ты сократишь потребление шоколада?",
    "When will you cut down on eating chocolate?"
  ],
  [
    "Кто-то вломился в его дом и украл его сбережения",
    "Someone broke into his house and stole his savings"
  ],
  [
    "Я не мог жить на двести долларов в месяц",
    "I couldn't get by on two hundred dollars a month"
  ],
  [
    "Он очень болен, но я уверен что он скоро поправится",
    "He is very ill but I am sure that he will get over soon"
  ],
  [
    "Все ее попытки подбодрить его провалились",
    "All her attempts to cheer him up failed"
  ],
  [
    "Воры ворвались внутрь и украли все драгоценности",
    "The thieves broke in and stole all the jewellery"
  ],
  [
    "Я решил попытаться сделать это снова",
    "I made up my mind to try to do it again"
  ],
  [
    "Как грабителям удалось ворваться?",
    "How did the burglars manage to break in?"
  ],
  [
    "Я еще не решил",
    "I haven't made up my mind yet"
  ],
  [
    "Я полагаю, эта новость взбодрит тебя",
    "I suppose this news will cheer you up"
  ],
  [
    "Было выдвинуто новое интересное предложение",
    "A new interesting suggestion was put forward"
  ]
]