[
  [
    "Ты когда-либо был в Америке?",
    "Have you ever been to America?"
  ],
  [
    "Я всегда хотел добиться успеха в жизни",
    "I've always wanted to succeed in life"
  ],
  [
    "Ты знаешь, я был там так много раз",
    "You know, I've been there so many times"
  ],
  [
    "Я был там несколько раз",
    "I've been there several times"
  ],
  [
    "Ты был в Америке в прошлом году?",
    "Were you in America last year?"
  ],
  [
    "Когда ты был там?",
    "When were you there?"
  ],
  [
    "Ты был за границей?",
    "Have you been abroad?"
  ],
  [
    "Я был там много раз",
    "I've been there many times"
  ],
  [
    "Ты был в Китае два года назад?",
    "Were you in China two years ago?"
  ],
  [
    "Я не нашел еще ничего подходящего",
    "I haven't found anything suitable yet"
  ],
  [
    "Я всегда хотел уделять этому больше свободного времени",
    "I've always wanted to devote more free time to it"
  ],
  [
    "Я уже отправил ему это сообщение",
    "I've already sent him this message"
  ],
  [
    "Ты когда-нибудь был в Италии? Я был там в прошлом году",
    "Have you ever been to Italy? I was there last year"
  ],
  [
    "Я только что прибыл в Англию",
    "I've just arrived in England"
  ],
  [
    "Ты когда-нибудь был в этой стране?",
    "Have you ever been to this country?"
  ],
  [
    "Как я знаю, он выпустил этот альбом около года назад",
    "As I know, he released this album about a year ago"
  ],
  [
    "Я никогда не думал об этом",
    "I've never thought about it"
  ],
  [
    "Когда ты был там в последний раз?",
    "When were you there last time?"
  ],
  [
    "Ты был в Китае?",
    "Have you been to China?"
  ],
  [
    "Ты когда-нибудь был за границей?",
    "Have you ever been abroad?"
  ],
  [
    "Она всегда хотела изучать психологию",
    "She has always wanted to study psychology"
  ],
  [
    "Ты когда-нибудь был в Латинской Америке? Я еще не был там",
    "Have you ever been to Latin America? I haven't been there yet"
  ],
  [
    "Он никогда не был за границей",
    "He's never been abroad"
  ],
  [
    "Ты знаешь, я всегда хотел добиться успеха в жизни",
    "You know, I've always wanted to succeed in life"
  ],
  [
    "Я еще не достиг этой цели",
    "I haven't achieved this aim yet"
  ],
  [
    "Ты когда-нибудь был в этом городе?",
    "Have you ever been to this city?"
  ],
  [
    "Ты знаешь, я слышал это так много раз",
    "You know, I've heard it so many times"
  ],
  [
    "Как я знаю, они уже приняли надлежащие меры",
    "As I know, they have already taken proper measures"
  ],
  [
    "Он приглашал меня к себе много раз",
    "He's invited me to him many times"
  ],
  [
    "Она уже упоминала это во время разговора",
    "She's already mentioned it during the conversation"
  ],
  [
    "Ты был в Индии?",
    "Have you been to India?"
  ],
  [
    "Я только что прибыл в аэропорт",
    "I've just arrived at the airport"
  ],
  [
    "Если честно, я никогда не рассматривал это действительно всерьез",
    "To be honest, I've never considered it really seriously"
  ],
  [
    "Ты знаешь, я слышал это тысячу раз",
    "You know, I've heard it a thousand times"
  ],
  [
    "Ты когда-нибудь был в Англии?",
    "Have you ever been to England?"
  ],
  [
    "Он только что прибыл на вечеринку",
    "He's just arrived at the party"
  ],
  [
    "Я еще не сделал это",
    "I haven't done it yet"
  ],
  [
    "Он уже упоминал об этом во время своего разговора",
    "He's already mentioned it during his conversation"
  ],
  [
    "Как я знаю, они выпустили этот альбом около месяца назад",
    "As I know, they released this album about a month ago"
  ],
  [
    "Ты когда-нибудь был в Испании? Еще нет",
    "Have you ever been to Spain? Not yet"
  ],
  [
    "Ты когда-нибудь был в Соединенных Штатах?",
    "Have you ever been to the United States?"
  ]
]