[
  [
    "Мне кажется, что это развивает наши аналитические способности",
    "It seems to me that it develops our analytical abilities"
  ],
  [
    "Я сидел дома весь день",
    "I was staying at home all day"
  ],
  [
    "Когда он окончил университет?",
    "When did he graduate from university?"
  ],
  [
    "Когда я заметил его, он что-то искал",
    "When I noticed him, he was looking for something"
  ],
  [
    "Я не согласен с этим утверждением сейчас",
    "I disagree with this statement now"
  ],
  [
    "Я разделил эту сумму денег на три части",
    "I divided this sum of money into three parts"
  ],
  [
    "Я был дома весь день",
    "I was at home all day"
  ],
  [
    "Я еще не подготовился к этому тесту",
    "I haven't prepared for this test yet"
  ],
  [
    "Он прилег в конце дня",
    "He lay down at the end of the day"
  ],
  [
    "Почему он улыбается?",
    "Why is he smiling?"
  ],
  [
    "Он обнаружил, что кто-то украл его сумку",
    "He discovered that someone had stolen his bag"
  ],
  [
    "Учитель разделил нашу группу на несколько частей",
    "The teacher divided our group into several parts"
  ],
  [
    "Я решил не следовать этой рекомендации",
    "I decided not to follow this recommendation"
  ],
  [
    "Такой пример действительно мотивирует меня",
    "Such an example really motivates me"
  ],
  [
    "Я только что прибыл на встречу",
    "I've just arrived at the meeting"
  ],
  [
    "Я помню, как это произошло",
    "I remember how it happened"
  ],
  [
    "Я уже протестировал свои знания",
    "I've already tested my knowledge"
  ],
  [
    "Я думаю, что мы тратим время впустую сейчас",
    "I think that we're wasting time now"
  ],
  [
    "Ты помыл посуду?",
    "Did you wash the dishes?"
  ],
  [
    "Что ты ищешь?",
    "What are you looking for?"
  ],
  [
    "Я обнаружил, что мне дали неверную информацию",
    "I discovered that they had given me the wrong information"
  ],
  [
    "Он сказал, что они разрушили здание полностью",
    "He said that they had destroyed the building completely"
  ],
  [
    "Становилось темнее, и мы решили повернуть назад домой",
    "It was getting darker and we decided to turn back home"
  ]
]