[
  [
    "Он говорит, что жизнь может наказать его",
    "He says that life can punish him"
  ],
  [
    "Что ты смотрел, когда он вошел в комнату?",
    "What were you watching when he entered the room?"
  ],
  [
    "Это стало настоящей сенсацией в этом году",
    "It's become a real sensation this year"
  ],
  [
    "Такая теория действительно существует",
    "Such a theory really exists"
  ],
  [
    "Они напали на своего врага внезапно",
    "They attacked their enemy suddenly"
  ],
  [
    "Они, в основном, производили очень дорогие товары",
    "They mostly produced very expensive goods"
  ],
  [
    "Я вспомнил, что удалил те файлы по ошибке",
    "I remembered that I had deleted those files by mistake"
  ],
  [
    "Я еще не нашел решение этой проблемы",
    "I haven't found a solution to this problem yet"
  ],
  [
    "Я уже заплатил за это",
    "I've already paid for it"
  ],
  [
    "Трудно поверить, что это только что произошло",
    "It's hard to believe that it's just happened"
  ],
  [
    "Она сказала, что он показал отличный результат",
    "She said that he had shown an excellent result"
  ],
  [
    "Я уже перевел этот текст",
    "I've already translated this text"
  ],
  [
    "Я постараюсь описать тебе свои чувства",
    "I'll try to describe you my feelings"
  ],
  [
    "Он подержал малыша на руках",
    "He held the baby in his arms"
  ],
  [
    "Я очень ценю вашу помощь",
    "I really appreciate your help"
  ],
  [
    "Я вижу, что они спорят о чем-то",
    "I see that they are arguing about something"
  ],
  [
    "Я слышал это время от времени",
    "I heard it from time to time"
  ],
  [
    "Я никогда не слышал такого потрясающего голоса",
    "I've never heard such an amazing voice"
  ],
  [
    "Я уже все проверил",
    "I've already checked everything"
  ],
  [
    "Я показал такой хороший результат",
    "I showed such a good result"
  ],
  [
    "Я обнаружил, что что-то было не так",
    "I found out that something was wrong"
  ],
  [
    "Трудно поверить, что это действительно возможно",
    "It's hard to believe that it's really possible"
  ]
]