[
  [
    "Моя мечта - это посетить эту страну однажды",
    "My dream is to visit this country one day"
  ],
  [
    "Он не был согласен с этим утверждением",
    "He disagreed with this statement"
  ],
  [
    "Ключи еще не нашлись",
    "The keys haven't been found yet"
  ],
  [
    "Ожидается, что эти проблемы будут скоро решены",
    "It's expected that these problems will be solved soon"
  ],
  [
    "Мы увидели, что магазин закрыт",
    "We saw that the shop was closed"
  ],
  [
    "Кому принадлежит этот дом?",
    "Who does this house belong to?"
  ],
  [
    "Все объяснили очень четко",
    "Everything was explained very clearly"
  ],
  [
    "Я сделаю это, если ты не возражаешь",
    "I'll do it if you don't mind"
  ],
  [
    "Об этом упоминалось в предыдущем видео",
    "It was mentioned in the previous video"
  ],
  [
    "Это только что было продано",
    "It has just been sold"
  ],
  [
    "Я прослушаю эту запись к завтрашнему дню",
    "I will have listened to this recording by tomorrow"
  ],
  [
    "Он сказал, что деньги никогда не мотивировали его",
    "He said that money had never motivated him"
  ],
  [
    "Такие меры привели компанию к банкротству",
    "Such measures led the company to bankruptcy"
  ],
  [
    "Я все еще рассматриваю это предложение",
    "I'm still considering this offer"
  ],
  [
    "Было не так легко поднять ту сумку",
    "It wasn't so easy to lift that bag"
  ],
  [
    "Если честно, у меня никогда не было такого рода опыта",
    "To be honest, I've never had this kind of experience"
  ],
  [
    "Конфликт был разрешен успешно",
    "The conflict was resolved successfully"
  ],
  [
    "Книга была опубликована в этом году",
    "The book has been published this year"
  ],
  [
    "Их новый альбом будет выпущен в этом году",
    "Their new album will be released this year"
  ],
  [
    "Это возможно изменит твою точку зрения",
    "It might change your point of view"
  ],
  [
    "Они соревнуются друг с другом очень долго",
    "They have been competing with each other for a very long time"
  ]
]