[
  [
    "Он сказал, что заказал нам такси",
    "He said that he had ordered us a taxi"
  ],
  [
    "У него не было времени побриться",
    "He didn't have time to shave"
  ],
  [
    "Он сказал, что хотел бы расслабиться чуть-чуть",
    "He said that he would like to relax a bit"
  ],
  [
    "Его успех действительно вдохновил меня идти вперед",
    "His success really inspired me to go ahead"
  ],
  [
    "Откровенно говоря, я едва ли могу представить это",
    "To be frank, I can hardly imagine it"
  ],
  [
    "Эта страна обеспечивается нефтью и газом",
    "This country is provided with oil and gas"
  ],
  [
    "К сожалению, их брак закончился разводом",
    "Unfortunately, their marriage ended in divorce"
  ],
  [
    "Он сказал, что перелез через забор",
    "He said that he had climbed over the fence"
  ],
  [
    "Как было сказано, она умерла от сердечного приступа",
    "As it was said, she had died of a heart attack"
  ],
  [
    "Он говорит, что одобряет этот выбор",
    "He says that he approves of this choice"
  ],
  [
    "Вам нужно выбрать правильный ответ",
    "You need to choose the correct answer"
  ],
  [
    "Как мы можем видеть, ферма простирается вдоль реки",
    "As we can see, the farm extend along the river"
  ],
  [
    "Ей было запрещено выходить из дома",
    "She was forbidden to leave the house"
  ],
  [
    "Я должен признать, что это была не моя инициатива",
    "I have to admit that it wasn't my initiative"
  ],
  [
    "Как ты относишься к списыванию?",
    "What's your attitude towards cheating?"
  ],
  [
    "Мы будем играть два часа к шести",
    "We will have been playing for two hours by six"
  ],
  [
    "Он остановился на минуту, а затем продолжил говорить",
    "He paused for a minute and then he continued talking"
  ],
  [
    "Ожидается, что его повысят в следующем году",
    "It's expected that he'll be promoted next year"
  ],
  [
    "Я остановился на время и выпил стакан сока",
    "I stopped for a while and drank a glass of juice"
  ],
  [
    "Я возможно опоздаю на встречу чуть-чуть",
    "I may be late for the meeting a bit"
  ],
  [
    "Пока они лежали на пляже, мы плыли на лодке",
    "While they were lying on the beach, we were sailing on a boat"
  ],
  [
    "Вы уже нарядили елку?",
    "Have you already decorated a Christmas tree?"
  ],
  [
    "Как написано, курение не разрешено здесь",
    "As it's written, smoking isn't allowed here"
  ]
]