[
  [
    "Он преподает английский язык около десяти лет",
    "He's been teaching English for about ten years"
  ],
  [
    "Как вы можете видить, сейчас все контролируется",
    "As you can see, everything is being controlled now"
  ],
  [
    "Он сказал, что они живут вместе два года",
    "He said that they had been living together for two years"
  ],
  [
    "Он сказал, что потерял билет",
    "He said that he had lost the ticket"
  ],
  [
    "Он сказал, что эта цель уже достигнута",
    "He said that this aim had already been achieved"
  ],
  [
    "Я хотел бы спросить тебя, что это значит",
    "I'd like to ask you what it means"
  ],
  [
    "Он решил, что сократит свою речь",
    "He decided that he would shorten his speech"
  ],
  [
    "Что повлияло на тебя больше всего?",
    "What influenced you most of all?"
  ],
  [
    "Она сказала, что они перепрыгнули через забор",
    "She said that they had jumped over the fence"
  ],
  [
    "Эта еда такая хорошая на вкус",
    "This food tastes so good"
  ],
  [
    "Он заметил, что еще один экземпляр оправят нам",
    "He noted that one more copy would be sent to us"
  ],
  [
    "Нашу группу разделили на три части",
    "Our group was divided into three parts"
  ],
  [
    "Это описано очень ярко в этой книге",
    "It's described very vividly in this book"
  ],
  [
    "Он пообещал, что представит эти материалы нам",
    "He promised that he would present these materials to us"
  ],
  [
    "Ей посоветовали перестать паниковать",
    "She was advised to stop panicking"
  ],
  [
    "Он боялся, что это будет ограничивать его свободу",
    "He was afraid that it would limit his freedom"
  ],
  [
    "Он очень сильно ударил ногой по мячу",
    "He kicked the ball very hard"
  ],
  [
    "Я собираюсь присутствовать на этой встрече. А ты?",
    "I'm going to attend this meeting. And you?"
  ],
  [
    "В чем они его обвиняют?",
    "What do they accuse him of?"
  ],
  [
    "Меня поприветствовали очень тепло",
    "I was greeted very warmly"
  ],
  [
    "Он был так зол, что порвал бумаги",
    "He was so angry that he tore the papers"
  ],
  [
    "Она познакомила его со своими родителями",
    "She introduced him to her parents"
  ]
]