[
  [
    "Он сказал, что нажал на кнопку",
    "He said that he had pressed the button"
  ],
  [
    "Я абсолютно уверен, что ты заслужил этот успех",
    "I'm absolutely sure that you deserve this success"
  ],
  [
    "Он молился Богу и его мечта сбылась",
    "He prayed to God and his dream came true"
  ],
  [
    "Она сказала, что споет свою любимую песню",
    "She said that she would sing her favourite song"
  ],
  [
    "Они еще не рассчитали все затраты",
    "They haven't calculated all the costs yet"
  ],
  [
    "Иногда говорят, что курение действительно убивает",
    "It's sometimes said that smoking really kills"
  ],
  [
    "Он толкнул дверь и вошел в комнату",
    "He pushed the door and entered the room"
  ],
  [
    "Он сказал, что сохранит этот секрет",
    "He said that he would keep this secret"
  ],
  [
    "Его предупредили об этом",
    "He was warned about it"
  ],
  [
    "Я не собираюсь мешать тебе",
    "I'm not going to disturb you"
  ],
  [
    "Он упал с велосипеда и повредил ногу",
    "He fell off the bike and hurt his leg"
  ],
  [
    "Если тебе будет нужно что-либо, просто дай мне знать",
    "If you need anything, just let me know"
  ],
  [
    "Было невозможно предсказать такие внезапные перемены",
    "It was impossible to predict such sudden changes"
  ],
  [
    "Я убедил его купить другую модель",
    "I persuaded him to buy another model"
  ],
  [
    "Я только что распечатал этот документ",
    "I've just printed this document"
  ],
  [
    "Я не помню сколько это стоит",
    "I don't remember how much it costs"
  ],
  [
    "Он сказал, что перезвонит мне",
    "He said that he would call me back"
  ],
  [
    "Позвольте мне добавить одну очень важную вещь!",
    "Let me add one very important thing!"
  ],
  [
    "Эту ошибку еще не исправили",
    "This mistake hasn't been corrected yet"
  ],
  [
    "Я едва ли осознавал, насколько это было важно",
    "I hardly realized how important it was"
  ],
  [
    "Его дом был куплен очень дешево",
    "His house was bought very cheaply"
  ],
  [
    "Он очень быстро оделся и ушел из дома",
    "He dressed very quickly and left home"
  ]
]