[
  [
    "Я не могу понять, о чем они говорят",
    "I can't understand what they're talking about"
  ],
  [
    "Он заработает эту сумму к следующему месяцу",
    "He will have earned this sum of money by next month"
  ],
  [
    "Что привлекло твое внимание?",
    "What attracted your attention?"
  ],
  [
    "Как я вижу, я не могу здесь припарковаться",
    "As I see, I can't park here"
  ],
  [
    "В дверь ударили так сильно",
    "The door was hit so badly"
  ],
  [
    "Она сказала мне, что заморозила овощи",
    "She told me that she had frozen the vegetables"
  ],
  [
    "Два дерева упали и заблокировали дорогу",
    "Two trees fell and blocked the road"
  ],
  [
    "Это изобрели в прошлом веке",
    "It was invented in the last century"
  ],
  [
    "Когда я увидел его, он стоял там",
    "When I saw him, he was standing there"
  ],
  [
    "Она выяснила, что он столько раз лгал ей",
    "She found out that he had lied to her so many times"
  ],
  [
    "Это помогло мне сформировать свое мнение по этому вопросу",
    "It helped me from my opinion on this issue"
  ],
  [
    "Его часто критикуют вовсе без какой-либо причины",
    "He's often criticized for no reason at all"
  ],
  [
    "Он сказал, что готовится к экзамену два часа",
    "He said that he had been preparing for the test for two hours"
  ],
  [
    "Он сказал, что уже заплатил за это",
    "He said that he had already paid for it"
  ],
  [
    "Я только что нажал на эту ссылку",
    "I've just clicked on this link"
  ],
  [
    "Его видели вчера там",
    "He was seen there yesterday"
  ],
  [
    "Я приклеил кусочек бумаги",
    "I stuck this piece of paper"
  ],
  [
    "Что ты намереваешься делать в этой ситуации?",
    "What do you intend to do in this situation?"
  ],
  [
    "Я планирую навестить семью в конце недели",
    "I'm planning to visit my family at the end of the week"
  ],
  [
    "Он повернулся, чтобы помахать ей, и она улыбнулась",
    "He turned to wave to her and she smiled"
  ],
  [
    "Он сказал, что не будет путешествовать так часто",
    "He said that he wouldn't travel so often"
  ],
  [
    "Он сказал мне, что она стала очень известной",
    "He told me that she had become very famous"
  ],
  [
    "Я только что отсканировал все документы",
    "I've just scanned all the documents"
  ],
  [
    "Как мне кажется, тебя неправильно поняли",
    "As it seems to me, you were misunderstood"
  ]
]